---
kind: method
id: M:Autodesk.Revit.DB.View.GetViewDisplayModel
zh: 视图
source: html/df7cfd06-5282-912b-25f0-e47128a2c62a.htm
---
# Autodesk.Revit.DB.View.GetViewDisplayModel Method

**中文**: 视图

Returns the current view display model settings for the view.

## Syntax (C#)
```csharp
public ViewDisplayModel GetViewDisplayModel()
```

## Returns
Current view display model settings.